let medcm = [{"sentiment": 0.9986922144889832, "input": "AITA for wanting my parents to die? | So I live with my parents. We don't have a great/close relationship, we're basically roommates. We just say a few sentences to each other here and there. I work and pay rent and for things like groceries, internet, phone. I'm slowly realizing that I'll never make enough money to buy my own house. \n\nI kinda just want them to die so I can take over the house, start on projects, have people over, and all that. I want to convert the backyard to a garden, redo the garage completely on my own, etc. Right now, they shut down anything I suggest. \n\nI feel like I'm in purgatory with my life right now. As fucked up as it sounds, I don't think I'd miss them at all.", "label": 1}, {"sentiment": 0.9984266757965088, "input": "AITA for not being excited about my friend's engagement? | My friend from university (we are both 27) just got engaged yesterday to a guy she has been dating for two months. She has an eleven month old and broke up with her child's father in about March/April. \n\nHer fiance is still living with his ex. He's always talked about wanting to work while she stayed at home with the baby. Now, they are engaged. WHAT. AITA? Can I say anything?", "label": 0}, {"sentiment": 0.9999734163284302, "input": "AITA for telling my girlfriend that she shouldn’t get a boob job. | My girlfriend is 20, I’m 23. We’ve been dating 3 years. She is absolutely gorgeous, very tall and skinny. She’s currently a 34B in terms of boob size and I think that’s just perfect. \n\nHowever she thinks they are too small. She has savings from work and wants to get silicone implants. She wants to be a 34C or D. I think thats too drastic and have advised her against it, especially since she’s so young. Plus I read that if you get implants it might mess with breastfeeding in later life.\n\nMy Gf said “its my body” and said I cant tell her what to do. Which is true but I just dont think a boob job is the best idea.\n\nAITA for saying so?", "label": 0}, {"sentiment": 0.9929752349853516, "input": "WIBTA for not wanting my girl to have buccal fat removal surgery. (Face surgery) | So my girlfriend(24) of 2 years randomly ask me if i was ok with her going to Peru( surgery is cheap) to remove her cheek fat. She’s a very pretty girl ,skinny, with chubby face cheeks. I think it’s cute. She always lingered around with the idea, but I never took her seriously till she ask for my opinion in a very serious tone. I told her that I had to think about it in an unenthusiastic way. I know it’s not my place to tell her what she can and cannot do but I feel like she’s perfect the way she is. WIBTA if I told her no.", "label": 0}, {"sentiment": 0.999329149723053, "input": "AITA for wanting to set the temperature of my apartment to 82’F on my period | My boyfriend comes to visit me at my apartment once a month or so. Whenever he comes over, I let him set the temperature because he runs hot where as I run cold (so I always have it around 77-82F). I set the temperature to 82F/27C while I showered so it would be hot when I got out because my stomach was hurting from my period. He saw this after and turned it down to 80F telling me 82 was too high because it would make him sweat. AITA for getting mad at the fact that he wouldn’t let me have the temperature that high even though I was having cramps or should I have just been happy with the compromise at 80F?", "label": 1}, {"sentiment": 0.9996422529220581, "input": "AITA if I give my niece her birthday present on her birthday (Dec 21) and tell her not to open it till Christmas? | She’s turning 9. I’m not loaded and am not in the greatest financial situation currently. I’m in over my head currently in Christmas gift debt and every dollar adds up. Not to mention it was hard to figure out what to get her since she has everything. How should I handle the situation?\n\nAITA?", "label": 1}, {"sentiment": 0.9994755983352661, "input": "WIBTA If I used credit card of a guy who hacked my blizzard account? | So long story short My blizzard account was hacked some time ago (probably because of leaked data) and I received it now I see that the person who hacked it left his credit card saved (To change battletag) and I can make purchase with it. \n\nSo would I be the asshole if I bought myself a month of wow subscription? Cause really wanna try but not sure if id like it.\n\nI know that it mostly depends on it if the person who used my account bought it or just hacked it, buy I spoke with support and they referred to a this person as a hacker. What are your thoughts?", "label": 1}, {"sentiment": 0.9999693632125854, "input": "AITA for wanting to tell my daughter myself | AITA for getting upset that my ex told our daughter that the man she calls papa is actually my stepdad not bio dad? She is 9 years old and I haven't seen my \"bio\" dad in about 23 years so to me my stepdad is my dad. My ex has been in and out of her life since she was a baby so her papa is the one constant positive male figure in her life. I was waiting for my daughter to be a bit older and then I'd explain the situation but now she feels like she is keeping a secret from her papa because she doesn't want him to know that she knows.......", "label": 0}, {"sentiment": 0.9917069673538208, "input": "AITA For not wanting my wife's single friend to come over with his kids when I'm not home? | My wife has a single friend and they text all the time. They are close friends. He mostly talks to her about his dates and other related things. He has 2 kids and the kids like to play with our kids so we arrange to have playdates during dinner time. They usually stay for a couple of hours. During the playdates, my, wife, myself, and her friend have a few drinks and hang out while the kids run around. \n\nI'm working late tomorrow night and won't be home until after 8. My wife still wants to have the playdate, however, I'm not comfortable with it and I don't think it is appropriate. Am I the asshole?", "label": 1}, {"sentiment": 0.999460756778717, "input": "AITA for asking my Maid of Honor to dye her hair darker for my wedding? | My Maid of Honor and I both have blonde hair. My hair is a darker blonde, whereas hers was dyed bright bleach blonde at the time of my asking. So a few months ago, as my wedding is next week, I asked her if she would be willing to dye her hair a darker color for the wedding so that my hair would be the lightest in the wedding party. I ONLY asked her this because she often dyes her hair different natural colors, including a dark brunette once. My Maid of Honor agreed readily, but the Best Man, who overheard the request, voiced that he thought that was a really shitty thing for me to ask. So AITA for asking my Maid of Honor to dye her hair for my wedding?", "label": 1}, {"sentiment": 0.999488353729248, "input": "wibta if i woke up my mom every day at 5:00 a.m | I'm thirteen and I like to go to sleep on the weekends from 12-3 a.m. For the past few months on every Saturday and Sunday she wakes me up with whatever means possible. I have to go through the rest of the day exhausted. During the school week i wake up around 5:00 a.m while my mom wakes up at 6:30. I have wanted her to see what it is like so, wibta", "label": 1}, {"sentiment": 0.9919336438179016, "input": "AITA for not giving a peadophile his pain relief? | As a nurse it is obviously my duty to provide care to anyone in need. A recent patient of mine was a convicted peadophile and fled from police when they went to arrest him again after new charges came to light. He injured himself breaking several bones while trying to flee. I was supposed to give him painkillers but falsified documents AITA?", "label": 1}, {"sentiment": 0.9977506995201111, "input": "AITA for not showering for a month | My girlfriend and i live together with my friend Danny. Danny and me made a bet: who takes a shower first, has to invite the other one for a dinner in a very expensive restaurant. \n\nI thought the bet would be over after a week or so and it would be an easy way for me to get some good food without paying money (i’m really broke).\nBut now the bet is on for about 40 days and we both really start to smell terrible.\nMy Girlfriend is super annoyed but Danny doesn’t want to call it quit and i can’t afford this fancy restaurant.", "label": 1}, {"sentiment": 0.9968641400337219, "input": "WIBTA for telling a girl she creeps me out after she got excited by my suffering? | I recently lost my girlfriend to a cerebral haemorrhage. I was offered time off from school but refused and went back to school the next day as I know it is what she would have wanted.\n\nThere has been lots of support from our (my girlfriend and I were in the same class) classmates but I have knuckled down and got on with stuff.\n\nOne girl has kept mentioning it though, she keeps saying how “attracted” (and yes she used that word) she is by my soldiering on through the grief. I was flattered the first few times but I feel enough is enough.\n\nI don’t want to be too harsh though as I know she has gone through problems herself.", "label": 0}, {"sentiment": 0.9999852180480957, "input": "AITA for landing football tickets and taking two of my kids instead of my wife? | I could of gotten four tickets from someone I know, but only wanted three. My wife doesn’t even like football. I took her to a few games before and she seemed completely disinterested. Also I get annoyed when she constantly asks me questions you know she doesn’t really care to hear the answer too. Questions about the game. \n\nBesides that, I just know it’s not her thing, it’s never been her thing going to sporting events. My youngest daughter wants to go, and so does my son. My wife is now upset because I didn’t get her a ticket. \n\nI’ve taken her so baseball, football, basketball games and she never cared and sometimes even denied going at the opportunity.", "label": 1}, {"sentiment": 0.9976999163627625, "input": "AITA for refusing to pay for my daughter's therapy appointments? | My 20-year-old daughter is living with me while she goes to college. She has always struggled with her weight and started having issues with anxiety and depression in high school. She sees a therapist once a week and the copay is $20 per appointment. She works part time but I help her with medical expenses since school is expensive.\n\nHere's the thing, I don't think she is giving herself a chance to beat the mental health issues, let alone her weight, unless she exercises. I told her I wouldn't pay for her therapy unless I see her take a walk every single day. AITA?", "label": 1}, {"sentiment": 0.9982081651687622, "input": "AITA for refusing to give my ex his family heirlooms back now that we’re divorced? | We were married 7 years. Towards the end I found out he was cheating on me with someone 10 years younger. Now he wants to propose to her and has asked me for my engagement ring which was a family heirloom and passed down from his grandma. \n\nHe has also asked for other pieces of jewelry back which were gifted to me from his mom and grandmother because they said they wanted to keep it in the family and see our kids have it one day. We have no children but if I have kids one day with someone else I’d be happy to give them these gifts.\n\nAITA if I don’t give him his family heirloom jewelry back?", "label": 1}, {"sentiment": 0.9998499155044556, "input": "AITA for buying my son a dirt bike after my wife said no? | My wife and I have a 6yo son. I grew up racing dirt bikes from the age of 5 and never stopped. My son has been asking to get one so I talked to my wife about it and she said no because it’s “too dangerous”. \n\nYeah you are bound to fall and break bones, but racing teaches you to not give up, and it’s a lot of fun, and my son is very interested. \n\nI went on Friday and picked him up one and my wife is furious, she said he’s going to die on this death machine and wants me to sell it now. I don’t think it’s fair to my son to say he can’t ride but I can. So AITA here?", "label": 1}, {"sentiment": 0.9996964335441589, "input": "AITA for locking my room while on vacation? | So while on a 9 day vacation me and my SO locked a door the leads to our two rooms. Our 3 other roommates like to party a lot and invite guests that they may have met that day or night(sketchy people)without really knowing them. The thing is thats the only way to get to the garage for laundry other then going outside and around. I also bought a keypad for the garage with my own money so they could go the outside way when locked. They tell us it’s not fair and we can’t lock it but we don’t agree. \nSo AITA?", "label": 0}, {"sentiment": 0.9998359680175781, "input": "AITA for making My GF (30) pay for daycare for my (33) son | My mother owns a daycare and offered to give my GF and I free daycare for our infant boy. Infant care is crazy expensive, $2700 a month. We both have good jobs but we would still struggle with the full monthly payment so free daycare is a huge blessing. \n\nWhile I think my mother's offer is awesome I felt bad for attending her business where she pays employees for free. I decided that at the minimum we should pay $1000/month and I'm making my GF split it with me. She is very unhappy with my decision but is reluctantly going along with it.\n\n AITA for forcing a financial decision on her instead of just taking the free daycare and dealing with my discomfort?", "label": 1}, {"sentiment": 0.9962000250816345, "input": "AITA for not wanting to anticipate paying for my overweight friend's accommodations? | A good friend of mine from college wants to visit me. I'm 32. Shes stayed in our small rural hometown while I've moved to a larger city. \n\nShes pretty overweight. Like, shes mobile. But idk, shes 33 and acts like shes 50.\n\nAside from work, I walk or ride my bike everywhere. I'm not fit, but I'm fairly active. And I like to walk if its practical. From experience, I know she is not this type of person at all. Stairs are a challenge. \n\nAITA if I refuse to pay for the additional Uber rides while she's here?", "label": 1}, {"sentiment": 0.999895453453064, "input": "AITA for wanting my room back when I come home from college? | There are three bedrooms in our house, one for the parents, another for my brothers, and one for me. I fully expected one of my brother's to move into my room when I went to college (why should they share a room if there is one available?) When I come home for weekends or extended breaks though, I still want a space in the house that isn't the living room couch. My parents have made it clear that the room is still mine and when I come back I can have it. My brother doesn't like to leave and often ends up sleeping on the floor when I use the bed. (He has his bed in his room still.) This has been making me feel pretty guilty, and I'm wondering AITA?", "label": 1}, {"sentiment": 0.9915235042572021, "input": "AITA for selling my friends car after he gave it to me? | Okay so my friend didn’t want his car and it was a 2005 Toyota Highlander V6 that had 110000 miles on it.\n\nHe just bought a new car and didn’t know what to do with it so he asked me and I said sure since I thought I would be giving it to a family member. I asked a couple of family members and none of them wanted it so I decided to sell it for the scrap metal.\n\nNow my friend found out and got mad at me because he said it was like his baby because he had it for so long but I told him why did you give me it then?\n\nSo aita?", "label": 1}, {"sentiment": 0.9959672689437866, "input": "AITA for not wanting to stay at an air B&B | My family and I (14 M) want to go on a vacation this summer to Edmonton. \n\nIt’s pretty expensive to fly there so right now the plan is to stay at and air B&B to save money. Now I have allergies to dogs and cats, both of which are common pets so I have to be careful. \n\nMy allergies are the reason I don’t want to stay at an air B&B as who knows who owns the house. \n\nI don’t feel safe staying there, so I said that I’m not going if we stay at an air B&B,and my aunt has said “So you are threatening to not go on a family trip if not everything is to your exact liking .”\n\nI just want to know if I’m the asshole.", "label": 1}, {"sentiment": 0.9998453855514526, "input": "AITA for calling this girl a gold digger? | We started chatting on bumble and she invited me to come to a sporting event with her because she didn't want to go alone. Tickets were expensive so she offered to subsidize mine and told me she didn't want to drive. My car has some issues so I told her we'd have to take hers, which she said was fine. Then when I was supposed to buy my ticket, my paycheck didn't come through so I asked her to spot me the money and she straight up ghosted me. I sent her a few more messages and the only thing she sent was a snap from the game, which I guess she went to with another guy. I got pissed and called her a gold digger because she only wants money from guys and she replied, \"what money lol\" AITA?", "label": 1}, {"sentiment": 0.9955829381942749, "input": "AITAH for not telling hubs medium size settlement came in? | Short and sweet, my husband works, I work as well. Every time I get paid he asks me to transfer some money to him, it usually ends up being about $80 total. When he gets paid I ask him to transfer money to me and he, most of the time, doesn't. When he does its maybe $20. I got a direct deposit of a settlement that's ours back a few days ago. I haven't told him, and have no plans of doing so. Am i the asshole?", "label": 1}, {"sentiment": 0.9999231100082397, "input": "AITA Half the people I know dislike me? | I tend to speak my mind and I have noticed out of half the places I worked I'd say half the jobs I got fired from because my co workers didn't like me ... the other half of jobs who kept me everyone was chill and we would go out for staff dinners and I was friends with those co workers mostly..\nI also have a close friend or two but all my other \"friends\" it seems like I lost quite a few over minor things or it's like you just can't seem to get along with them...like there is always tension for some reason . ..why???\nWhy with some there is tension and others it is calm??\n\n\nWhy in life does it seem like 50% of people will like you and the other 50% will dislike you??", "label": 1}, {"sentiment": 0.9966844916343689, "input": "AITA for getting mad at my bf for not driving me to the bus stop? | My bus stop is about a 15 min walk from my house and it looks like it's going to rain. My boyfriend refuses to give me a ride and thinks I'm crazy for even asking. I asked, \"what if it rains?\" to which he replied, \"you'll get wet!\". He's not busy. Just playing Sudoku on his phone. So I got mad and said he's not being a very considerate boyfriend. He said I'm the one who's not being considerate because I shouldn't expect him to drop everything to give me a ride when I could walk. \n\nSo who's the asshole?!", "label": 1}, {"sentiment": 0.9999637603759766, "input": "AITA for not making a right on red | So for any non American drivers, in the States we can make a right turn on a red ligh. Provided there are no signs prohibiting it and the way is clear.\n\nI don't always make a right on red if I can or I'm slow about it to make sure I have a clear path. But the fastest way for someone to get me to not take a right on red is to honk at me.\n\nIf they honk at me I wave at them, watch them in my review mirror and calmly wait for the next green light. If they honk again or make hand gestures I wave again. Sometimes I'll give them a thumbs up. I find honking at people to be rude.", "label": 1}, {"sentiment": 0.9984632730484009, "input": "AITA for charging new roommates 'market rent' and pocketing the difference? | I live in a house with 4 roommates. Our landlord is super chill and hasn't raised the rent much in 4 years so we are paying well under market rate. As roommates leave (say they are paying $500) and new roomates come in we charge the new roommate the market rent (say $700) and reduce all existing roommates rent evenly. \n\nThis ends up producing some strange room payments where there are 2 identical rooms and one person is paying $200 more than the other. \n\nIs this fair? Is it assholish? It's always akward when the new roommate finds out what we all are paying.", "label": 1}, {"sentiment": 0.9997498393058777, "input": "AITA for giving the toys of my eldest son to my youngest despite his protests? | I have two boys - 7 and 14. My 14yo is into media, sports and techs whereas my 7yo is way more interested in toys, which is normal. My 14yo has a ton of toys that he hasn't played with in years that have been sitting in the toy closest. Instead of buying brand new toys for my 7yo, I started to give him the ones my 14yo stopped playing with. My 14yo had a fit over it. I asked him what the big deal was by giving his brother a damn Lego set that my 14yo hasn't used in five years and will never use again? It's like giving my 7yo one of his old shirts. If it's good quality, then I am not buying it twice.", "label": 1}, {"sentiment": 0.9999042749404907, "input": "AITA for reporting a crazy girl to the school dean. | so me 17f stumbled across a Instagram account that was so creepy, this girl who had a crush on one of the boys in my class had made a Instagram account to post about how much she loved him, this included edited photos of her and him. fanfictions of them doing inappropriate things and videos where she talked about how much she loved him, it made me feel grossed out. \n\nfrom the posts made on her story it looked like she would occasionally follow him to different places. \n\nI showed the evidence to the dean and they are now dealing with it, the school found out and have been talking about it. \nI have seen that some of her friends are super unhappy and mad that someone would do that.\n\nAITA?", "label": 0}, {"sentiment": 0.9999103546142578, "input": "AITA for giving my friend a switch? | So normally, our friend group usually gets together every weekend to play smash bros and other mario games, while one friend (jonas) without a switch just borrows a controller and plays. \n\n​\n\nrecently, i(16m) won a raffle for 400 dollars, so I decided to gift jonas a switch and a pro controller so he can use his own stuff and play by himself. when i did, the rest of my friends got mad because i gave him an expensive gift while i only gave them the usually 30-50 dollar gifts for their b days. they said i was being unfair and that he could buy his own shit. aita for giving my buddy a switch?", "label": 0}, {"sentiment": 0.9970287084579468, "input": "AITA for telling my parents that my brother has a pillow with an anime girl on it? | I found it hidden in his room while going through his stuff. It's like one and a half meter long and there's a white haired girl on it in a blue green jacket, if you turn the pillow around she's put off the jacket ...\n\nWeird stuff so I told my Mom about it, now he's gotten into trouble for it, she took it away, he's not allowed to watch anime any more and I overheard her telling him that she was setting up an appointment for a psychologist. \n\nDid I do wrong?", "label": 1}, {"sentiment": 0.999873161315918, "input": "AITA for telling my significant other she is being unfair to request for me to eat my food quicker because the sound of me eating annoys her? | My SO and I live together and at the beginning of our relationship she mentioned she hates the sound of other people eating. As our relationship progressed she mentioned that I’m a loud chewer. I try my best to eat quietly but today I was eating a popsicle and she asked me to eat it faster because the sound was driving her nuts. I tell her she is being unfair and she blows up at me calling me a dick for not appeasing her. She stormed off and now is upset. AITA?", "label": 0}, {"sentiment": 0.9976139068603516, "input": "WIBTA if I told my friend I saw his ex girlfriend on tinder? | So my friend broke up with his semi long term girlfriend over the weekend. Both of them took it pretty hard, and she really freaked out. She was calling and text him, his family, and friends non stop for the first few days. \n\nIt was his first relationship and he was pretty broke up over it, even though he dumped her. But he’s constantly saying he just wants her to move on and be happy. \n\nWell I saw her on tinder today. She really wasted no time jumping back into things. I want to tell my friend that she’s happy and moving in like she wants, but he’s also pretty beat up over the whole thing. WIBTA?", "label": 1}, {"sentiment": 0.9988071918487549, "input": "AITA for skipping a wedding because my significant other wasn’t invited? | Old college friend invited a bunch of The College Guys to his wedding, but due to limited space, he didn’t offer +1s or invites to many of the girlfriends/wives. On top of that, he only sent invites a month in advance with less than a week to RSVP.\n\nI confirmed with him that it wasn’t an oversight. He’s known my GF as long as he’s known me, and he’s known we’re together, so it’s not accidental.\n\nThoughts?", "label": 0}, {"sentiment": 0.991333544254303, "input": "AITA for vandalizing someone's car? | So I come back to my car in the office car park and noticed someone had parked very close in the next bay. As I always do when this happens I checked to see if they'd opened their door against mine and....yes, nice new parking ding in my previously unblemished bodywork.\n\nI got in my car and nailed their door with mine in the process, then also left a screw under their rear wheel so hopefully they'd get a puncture.\n\nOn the one hand I'm worried they may have a blowout on the way home and be injured or die, but on the other hand...fuck inconsiderate arseholes.\n\nAITA?", "label": 1}, {"sentiment": 0.9999046325683594, "input": "AITA for expecting my parents to pay for my food? | I’m 16 and recently decided to go vegan. I researched everything and found out how to get all the nutrients etc and I told my parents and they said ‘you can if you pay for your own groceries’ which I find stupid for 3 reasons. Vegan food is a lot cheaper than the groceries I currently am eating. I’m planning on cooking my own meals (which I mostly do now anyway). I’m 16 and still living with my parents and just because I’ve made a decision to better my health does not mean I should be paying for my own food. My parents don’t let me get a job because they want me to focus on my studies so I don’t know how the hell they expect me to pay. \n\nAITA for expecting and wanting them to pay?", "label": 0}, {"sentiment": 0.9999819993972778, "input": "AITA thinking my SO is not fair when I'm going out with my friends and she becomes sad/grumpy | SO and I dated in her country for a year. Decided to move to my country where she doesn't have any friends, family and doesn't speak the language. We've lived here for 18 months, and we hang out with my family, my friends and spend most of the time together. She has had a job from day one. \n\n\nI hang out with my friends without her max once per week. Very often she gets sad / grumpy because this reminds her of not having her own family/friends around. I understand her situation and sacrifice but still think it should be okay to do stuff without her. AITA?\n\nThank you for your thoughts!", "label": 0}, {"sentiment": 0.9999816417694092, "input": "AITA for taking the cash winnings from a 50/50 raffle at my buddies stag party? | So one of my friends, who I met through my high school job 8 years ago is getting married and this past weekend he had his stag party of about 30 guys. \n\nAt the party they had raffle baskets you could buy raffle tickets for and a 50/50 raffle. Meaning whoever wins keeps half the of money raised from selling said tickets. \n\nTurns out I won after buying $30 worth of tickets and a $25 ticket to get in I won a $105 pot and proceeded to get boo-ed after taking the pot instead of donating it. But $105 really helped me out a lot this month so I was very happy to find out I actually won something. AITA or were they just drunk dudes giving me a hard time?", "label": 0}, {"sentiment": 0.992120623588562, "input": "AITA for telling my girlfriend she has ‘Waluigi Energy’? | K so I was on the phone with my girlfriend while on a business trip and — well, you know that meme about the existentialism of Waluigi? Like how he only exists as the inverse of the other characters, as a parody — my girlfriend said she feels like she has to be loyal to Peach because that’s always been her choice as a character to play. \n\nI then said I feel like she’s Peach on the outside but Waluigi in the inside. She always does the WAAAAAH like all the time so I just ran with it. She asked me to elaborate and I said she has ‘Waluigi Energy’ and now she’s kind of mad at me. \n\nAITA?", "label": 0}, {"sentiment": 0.9999319314956665, "input": "AITA for feeling a sense of dispair/overwhelmed at the thought of taking care of my little brother with Down Syndrome? | I have a 14 year old brother with Down Syndrome, and im currently 20. Last week, my parents sat down with me to explain our financial situation and how, when they are gone, my brother and I will have to take care of my little bro and provide for him (not entirely) for the rest of our lives. This made me feel kinda overwhelmed and wished i wouldnt have this responsability. And part of me thinks im a piece of shit for it but part of me doesn't. AITA?", "label": 0}, {"sentiment": 0.9991583824157715, "input": "AITA for not pushing my wedding back | I have been engaged to the love of my life for about 8 months now and we have been planning our wedding for October of 2020 and have already booked our venue. Last week my sister found out she’s pregnant and will be due the same week as my wedding and is trying to convince me to move it around. She’s been actively trying to conceive for a few months but she never actually thought out when the baby would be due. I refused to move the wedding to another month because my fiancé’s family isn’t local like mine is and they will be traveling from across the US along with several groomsmen. AITA for not wanting to plan my wedding around her?", "label": 0}, {"sentiment": 0.9995220899581909, "input": "AITA for wanting to take my daughter to the beach for the first time next year without her mother (my ex)? | My daughter currently lives primarily with my ex. She's nearly 2. Next year I want to take her to the beach with myself and the rest of the family, but ex/mother said \"no she can't go with you because I want to be there for her first beach trip\". So she is refusing to let our daughter go to the beach, because she can't be there too. AITA for wanting daughter to go to the beach with us, despite the fact that ex/mother wouldn't be there to see it?", "label": 0}, {"sentiment": 0.999663233757019, "input": "AITA for banning FortNite in my house? | My 12yo son loves video games and has been playing a lot of FortNite as all the cool kids do these days. I decided to buy a used Nintendo64 from EBay so I could show him some of the games I played when I was a kid. It came in the mail and within a minute of watching Super Mario 64 he deemed the game \"boring\" and went back to his room to play FortNite. I said that if wasn't going to respect for my childhood then there wouldn't be a respect for the games he liked. So this morning I took out his PlayStation and confiscated it until he learns better manners. My wife is absolutely furious with me over this. Shouldn't a kid learn some manners? AITA?", "label": 1}, {"sentiment": 0.999077558517456, "input": "WIBTA If I created an autobot to reply to my girlfriend? | I get pretty busy at work and with life sometimes. On many occasions my girlfriend and I will reiterate our \"I love you\", kiss emoji's and whatnot.\n\nWould I be the asshole if I created an autobot, script, app..etc that would auto reply to my girlfriend whenever she texts \"I love you\" or sends me a kiss emoji?", "label": 1}, {"sentiment": 0.9998681545257568, "input": "AITA for telling a woman she's too old to be hitting on me? | I (21M) get told I'm good looking/hot etc quite often.\n\nSo several weeks ago before the current predicament, I was out partying and one of my cousin's friends (31F) approaches me. This is the first time I've seen her drunk and she's a bit more energetic than usual, fair game. She's usually more reserved.\n\nBut then she looks at me and says \"I've always found you hot\" and gets a bit handsy.\n\nI then looked her in the eye and told her that she's too old to be hitting on me, that she's nearly 10 years older than me.\n\nShe got offended and called me AH and my cousin said I was an AH but I don't know if I was. Felt weird to have a 30 something hit on me tbh. It felt unnatural. AITA?", "label": 0}, {"sentiment": 0.9999008178710938, "input": "AITA for finding my girlfriend's Tumblr account? | We were sitting together, stirring up old stories from high school, and she said that she used to have a tumblr where she would put her drawings and stuff. She found my old Instagram I would use in high school for cosplay and role playing by searching usernames, and I did the same to her and came across it. She immediately got mad, as I guess she didn't want me to see it, but she's seen my old insta and my old tumblr from my weeb phase. \nAITA?", "label": 0}, {"sentiment": 0.999815821647644, "input": "AITA for keying a car that was parked in my assigned spot? | I pay $85 a month for this spot in my apartment complex, and the garage is gated off so random cars shouldn’t usually get in. They must’ve followed someone through the gate right as it opened and took my spot while I was gone. If I pay so much for this spot, a dickhead should not try and sneak in here for free. And this is the second time this car has done so in the last two months!! I took a picture last time and it’s the same ass car. That’s why I decided to key it. Am I the asshole for fighting fire with fire??", "label": 1}, {"sentiment": 0.9917961955070496, "input": "WIBTA for giving my wife a spin bike for her birthday? | My wife used to like going to spin class as her preferred form of exercise. Now, a few years and two kids later, we've moved to a city where spin classes aren't as easily accessible.\n\nI've been thinking about purchasing a spin bike and membership to something like the Peloton app online classes for a birthday or Christmas present. I know she would really like the opportunity to get into spin again, but I can't help but worry that she will see a fitness-related present as a criticism of her appeance. I would ask her, but she really like presents to be a surprise.\n\nSo now I'm left wondering... would I be the asshole if I buy my wife a spin bike for her birthday?", "label": 0}, {"sentiment": 0.9999897480010986, "input": "AITA for calling everyone in the service industry \"sir\" or \"maam\"? | Am I the asshole for calling every waiter, barman, cashier, etc, sir ou madam (not in English but in the language of my country), even when they are visibly younger than me? \n\n​\n\nIt's a habit I think I picked up from my parents, and it didn't use to be a problem when everyone I said it to was older than me, but now I'm 30ish, and I've been informed some people view it as somewhat pedantic / assholeish when I say it to younger people.\n\n​\n\nAm I the asshole?", "label": 0}, {"sentiment": 0.999582827091217, "input": "AITA for ignoring my Uber driver and tapping my headphones? | I’ll be honest. A silent Uber driver is the best one. Last night I was in an Uber and he and didn’t talk at first. So I put my headphones on to listen to music. Less then a minute later he asks me about my night. Usually I’ll respond but make it obvious I don’t want to talk. But last night I made a tapping motion to my headphones. He responded to that by saying “thanks, that was rude.” I responded “I don’t wanna talk to you” and just listened to my music for an awkward 15 minutes.", "label": 1}, {"sentiment": 0.9909858703613281, "input": "AITA for being upset that my niece and nephew said they don't consider me their uncle? | I'm 13. My niece is 21 and my nephew is 23 so yeah I'm basically 8 to 10 years older than they are... they said the age difference and I quote them is \"hella weird\" and that I'm just a younger cousin to them and not an uncle because I'm not older like 50+ all of our other aunts and uncles ages are. I told them they needed to respect me as their uncle but they laughed and said \"do you know how insane you sound? You're 10 years younger than us that is not an uncle you're just a younger cousin is all.\" So, AITA?", "label": 1}, {"sentiment": 0.9999927282333374, "input": "AITA for going to an Audition instead of going to my best friends dads funeral | My friends dad died the other day and his funeral is next week. I grew up with their family and I’m very upset by his death, however I have an important audition the day of his funeral. I’m an actress and this could be a really amazing job for me if I get it. I told my friend I wouldn’t be able to come and she seems really off with me. I know she’s going through a lot right now and I wanna be there for her but this audition is really important. \n\nAITA for going to the audition instead of his funeral?", "label": 1}, {"sentiment": 0.9980625510215759, "input": "WIBTA for “hiding” a Netflix show from my partner’s account? | There is a new true crime documentary about a horrific child abuse case. My partner loves true crime documentaries and i am certain his algorithms will suggest the limited series. We share an account but use different profiles. WIBTA if I “hide” the show from him? (I guess you can do this with the thumbs down option?) \n\nMy reasoning is that he works in social services and it’s a very emotionally draining job that he takes really hard and seriously, and I know he’ll feel compelled to watch and will drive himself crazy with the failures of the system and the social workers. \n\nI am worried this would make me TA because of invasion of privacy, but i worry about his wellbeing.", "label": 1}, {"sentiment": 0.9985305070877075, "input": "AITA for asking the maintenance man if he stole something? | This happened years ago and I've wondered this entire time if I was being rude.\n \nTo make it a short story, a friend of mine gave me a small baggie of creatine to try. For those who might not know, creatine is an unassuming white powder.\n \nI never got around to trying it because it disappeared shortly after my apartment complex's maintenance guy visited my unit for something or other. I looked everywhere for it, but it was no longer on the kitchen table where it had been.\n \nI went to the office to ask \"if maybe he'd seen it\" and that it looked \"a lot like drugs.\"\n \nThe insinuation didnt go unnoticed. He wasnt happy with me.", "label": 1}, {"sentiment": 0.9992740750312805, "input": "AITA for making the rice crispy treats? | We had leftover rice crispies from a recipe and I asked my wife \"What do we do with all of this cereal neither of us will eat ?\" . She said \"Maybe rice crispy treats, the kids could eat them\". I've never made rice crispy treats but gave it a shot. So.... when the wife came in from a run I was deemed an asshole for making treats that were not on her diet (what treats are ?, but I digress). A child unit took them to school therfore removing the offending snacks. \n\nFollow up... the first batch (made a week ago) turned out horrible. So I decided to double down and remade them altering the recipe. Very tasty this time. Still carry the title \"Asshole\".", "label": 0}, {"sentiment": 0.9981850981712341, "input": "AITA for letting people who walk with their phones 2 inches from their faces walk straight into me on the sidewalk? | To be honest, it only happened 4-5 times to this day, but when the situation is right, I just can't resist.\n\nI'm never agressive or sanctimonious when I do it. I just smile, I say \"woops\" or something like that, and let people be uncomfortable for a second.\n\nI am shocked by the inability of some people to discipline themselves to be in the present moment and to be aware of their environment. I'm sure I'm not the only one thinking that.\n\nSo I guess that's my way of expressing it, but maybe I should just care less and let people manage their lives as they wish... Is that an asshole thing to do?", "label": 1}, {"sentiment": 0.9999758005142212, "input": "AITA for eating all the caramel corn out of the mixed popcorn tin? | There are three flavors: white cheddar, butter, and caramel corn. My girlfriend likes all three, but her favorite is the caramel corn. I only like the caramel corn. AITA for eating all the caramel corn and leaving her with the white cheddar and butter flavors?", "label": 1}, {"sentiment": 0.9962195158004761, "input": "WIBTA.. For turning up at a guys house after he ghosted me | So been bugging me for a week now. Was seeing this guy for a few months, I thought everything was going great. Had a text conversation with him late at night, both made a few jokes, said goodnight. Not heard anything back from him since that night. No signs of an argument. Been blocked on WhatsApp, I've tried ringing won't connect so I presume he's also blocked my texts. Would I be out of order to turn up at his door to find out what's gone on", "label": 1}, {"sentiment": 0.9939996600151062, "input": "AITA for not replacing an iPhone my kids broke? | Family member comes to the house, there's a separate area for the toddlers where they have full range. I said to them, as I do to everybody, \"don't leave you phone hacking around, they'll touch it\". During the course of the day they leave their phone on a side table and go use the restroom. Whilst they're gone one of the kids picks it up and drops it on the tile floor cracking the screen. \n\nThey want me to pay for it but I said no way, not only did I warn them, it's common sense not to leave valuable delicate things unsupervised around toddlers. \n\nAITA for not paying to fix it or replacing it?", "label": 1}]
